#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke-template/runs/run-oNEF8yxjSm3kPnrF

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.gke.data.google_container_cluster.current_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "current_cluster"  {
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + cluster_telemetry                 = (known after apply)
      + confidential_nodes                = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + description                       = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + initial_node_count                = (known after apply)
      + instance_group_urls               = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "asia-southeast2"
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = (known after apply)
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_version                      = (known after apply)
      + notification_config               = (known after apply)
      + operation                         = (known after apply)
      + pod_security_policy_config        = (known after apply)
      + private_cluster_config            = (known after apply)
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + self_link                         = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # module.gke.google_compute_address.cloud_nat_ip will be created
  + resource "google_compute_address" "cloud_nat_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-nat"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.gke.google_project_iam_binding.compute-network-user will be created
  + resource "google_project_iam_binding" "compute-network-user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:434072338061@cloudservices.gserviceaccount.com",
          + "serviceAccount:service-434072338061@container-engine-robot.iam.gserviceaccount.com",
        ]
      + project = "test-gcp-project-01-274314"
      + role    = "roles/compute.networkUser"
    }

  # module.gke.random_id.run_id will be created
  + resource "random_id" "run_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.gke.module.cloud_nat.google_compute_router.router[0] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-router"
      + network            = "test-private-vpc"
      + project            = "test-gcp-project-01-274314"
      + region             = "asia-southeast2"
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode = "DEFAULT"
          + asn            = 64514
        }
    }

  # module.gke.module.cloud_nat.google_compute_router_nat.main will be created
  + resource "google_compute_router_nat" "main" {
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = 64
      + name                                = (known after apply)
      + nat_ip_allocate_option              = "MANUAL_ONLY"
      + nat_ips                             = (known after apply)
      + project                             = "test-gcp-project-01-274314"
      + region                              = "asia-southeast2"
      + router                              = "gke-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30
    }

  # module.gke.module.cloud_nat.random_string.name_suffix will be created
  + resource "random_string" "name_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.gke.module.primary-cluster.google_compute_firewall.intra_egress[0] will be created
  + resource "google_compute_firewall" "intra_egress" {
      + creation_timestamp = (known after apply)
      + description        = "Managed by terraform gke module: Allow pods to communicate with each other and the master"
      + destination_ranges = (known after apply)
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = "test-private-vpc"
      + priority           = 1000
      + project            = "test-gcp-project-01-274314"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = (known after apply)

      + allow {
          + ports    = []
          + protocol = "ah"
        }
      + allow {
          + ports    = []
          + protocol = "esp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
      + allow {
          + ports    = []
          + protocol = "sctp"
        }
      + allow {
          + ports    = []
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # module.gke.module.primary-cluster.google_compute_firewall.master_webhooks[0] will be created
  + resource "google_compute_firewall" "master_webhooks" {
      + creation_timestamp = (known after apply)
      + description        = "Managed by terraform gke module: Allow master to hit pods for admission controllers/webhooks"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = "test-private-vpc"
      + priority           = 1000
      + project            = "test-gcp-project-01-274314"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/28",
        ]
      + target_tags        = (known after apply)

      + allow {
          + ports    = [
              + "8443",
              + "9443",
              + "15017",
            ]
          + protocol = "tcp"
        }
    }

  # module.gke.module.primary-cluster.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = true
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "asia-southeast2"
      + logging_service             = "none"
      + master_version              = (known after apply)
      + monitoring_service          = "none"
      + name                        = (known after apply)
      + network                     = "projects/test-gcp-project-01-274314/global/networks/test-private-vpc"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = [
          + "asia-southeast2-a",
          + "asia-southeast2-b",
          + "asia-southeast2-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = "test-terraform-project-01"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/test-gcp-project-01-274314/regions/asia-southeast2/subnetworks/test-private-vpc-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = false
            }

          + dns_cache_config {
              + enabled = false
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }

          + horizontal_pod_autoscaling {
              + disabled = true
            }

          + http_load_balancing {
              + disabled = false
            }

          + istio_config {
              + auth     = "AUTH_MUTUAL_TLS"
              + disabled = true
            }

          + kalm_config {
              + enabled = false
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = "BALANCED"
          + enabled             = false

          + auto_provisioning_defaults {
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + state = "DECRYPTED"
        }

      + default_snat_status {
          + disabled = false
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "test-private-vpc-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "test-private-vpc-services"
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = 0
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = "default-pool"
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = (known after apply)
              + taint             = (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = "GKE_METADATA_SERVER"
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = false
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "10.0.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = true
            }
        }

      + release_channel {
          + channel = "RAPID"
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + identity_namespace = "test-terraform-project-01.svc.id.goog"
        }
    }

  # module.gke.module.primary-cluster.google_container_node_pool.pools["pool-01"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = (known after apply)
      + id                  = (known after apply)
      + initial_node_count  = 1
      + instance_group_urls = (known after apply)
      + location            = "asia-southeast2"
      + max_pods_per_node   = (known after apply)
      + name                = (known after apply)
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + project             = "test-terraform-project-01"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 200
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = 0
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = 2
          + max_unavailable = 1
        }
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-log_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/logging.logWriter"
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/monitoring.viewer"
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke.module.primary-cluster.google_service_account.cluster_service_account[0] will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "test-terraform-project-01"
      + unique_id    = (known after apply)
    }

  # module.gke.module.primary-cluster.random_id.name["pool-01"] will be created
  + resource "random_id" "name" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "accelerator_count" = ""
          + "accelerator_type"  = ""
          + "disk_size_gb"      = "200"
          + "disk_type"         = "pd-standard"
          + "labels"            = ""
          + "local_ssd_count"   = "0"
          + "machine_type"      = "n1-standard-2"
          + "metadata"          = ""
          + "oauth_scopes"      = "https://www.googleapis.com/auth/devstorage.read_only,https://www.googleapis.com/auth/logging.write,https://www.googleapis.com/auth/monitoring,https://www.googleapis.com/auth/service.management.readonly,https://www.googleapis.com/auth/servicecontrol,https://www.googleapis.com/auth/trace.append"
          + "preemptible"       = "false"
          + "service_account"   = ""
          + "tags"              = ""
          + "taints"            = ""
        }
      + prefix      = "pool-01-"
    }

  # module.gke.module.primary-cluster.random_shuffle.available_zones will be created
  + resource "random_shuffle" "available_zones" {
      + id           = (known after apply)
      + input        = [
          + "asia-southeast2-a",
          + "asia-southeast2-b",
          + "asia-southeast2-c",
        ]
      + result       = (known after apply)
      + result_count = 3
    }

  # module.gke.module.primary-cluster.random_string.cluster_service_account_suffix will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "3"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ca_certificate      = (sensitive value)
  + client_token        = (sensitive value)
  + cluster_name        = (known after apply)
  + kubernetes_endpoint = (sensitive value)
  + service_account     = (known after apply)
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*